"CIAdditionCompositing" = "Добавляет цветовые компоненты для усиления яркости. Данный фильтр, как правило, используется для добавления светлых участков и эффектов светорассеяния в объективе.";"CIAffineClamp" = "Выполняет аффинное преобразование исходного изображения, а затем фиксирует пиксели на краю преобразованного изображения, вытягивая их от центра. Данный фильтр выполняет функции, сходные с фильтром CIAffineTransform. Отличие заключается в том, что он создает изображение с неограниченной протяженностью. Данный фильтр может быть использован, если необходимо размыть изображение, избежав при этом появления неяркой черной границы по краям изображения.";"CIAffineTile" = "Выполняет аффинное преобразование изображения и располагает мозаикой преобразованное изображение.";"CIAffineTransform" = "Выполняет аффинное преобразование изображения. Вы можете сжать или растянуть по осям, выполнить отражение или поворот изображения. Вы также можете выполнить комбинацию данных действий.";"CIBarsSwipeTransition" = "Осуществляет переход от одного изображения к другому, сглаживая углы изображения, находящегося на переднем плане.";"CIBlendWithMask" = "Использует значения маски оттенков серого для интерполяции изображения и фона. Если значение маски равно 0.0, результатом является фон. При значении маски 1.0 результатом является изображение.";"CIBloom" = "Сглаживает края и придает изображению привлекательный блеск.";"CIBoxBlur" = "Сглаживает изображение или делает его более резким с помощью эффекта свертки прямоугольной формы.";"CIBumpDistortion" = "Создает вогнутый или выпуклый рельеф, появляющийся в определенном месте изображения.";"CIBumpDistortionLinear" = "Создает рельеф, возникающий из линейного участка изображения.";"CICMYKHalftone" = "Создает цвет, полутональный вариант исходного изображения с использованием голубой, малиновой, желтой и черной краски на белом листе.";"CICheckerboardGenerator" = "Создает рисунок шахматной доски. Вы можете указать размер и цвета шахматной доски, а также резкость рисунка.";"CICircleSplashDistortion" = "Искажает пиксели, начиная с периферии круга по направлению от центра.";"CICircularScreen" = "Симулирует полутональное изображение округлой формы.";"CICircularWrap" = "Заворачивает изображение вокруг прозрачной окружности. Искажение изображения возрастает с удалением от центра окружности.";"CIColorControls" = "Настроить значения насыщенности, яркости и контрастности.";"CIColorCube" = "Использует трехмерную таблицу цветов для преобразования пикселей исходного изображения. Таблица цветов должна состоять из ячеек с плавающей точкой RGBA, использующих premultiplied alpha. Ячейки организованы в стандартном порядке. Колонки и ряды данных отмечены соответственно красным и зеленым цветами. Каждое поле данных сопровождается следующим, более высоким полем данных. При этом поля выделены синим цветом.";"CIColorInvert" = "Инвертирует цвета изображения.";"CIColorMap" = "Выполняет нелинейное преобразование значений исходного цвета, используя соответствующие значения, приведенные в таблице.";"CIColorMatrix" = "Увеличивает значения исходного цвета и добавляет фактор смещения к каждому цветовому компоненту.";"CIColorMonochrome" = "Преобразовывает цвета таким образом, что они становятся оттенками одного цвета.";"CIColorPosterize" = "Преобразовывает красные, зеленые и синие цветовые компоненты в ряд значений яркости, указанные Вами для каждого цветового компонента. Данный фильтр выравнивает цвета для получения эффекта, имитирующего шелкотрафаретный способ печати.";"CIComicEffect" = "Симулирует иллюстрацию комикса, выделяя края и применяя эффект полутонов.";"CIConstantColorGenerator" = "Создает сплошной цвет. Как правило, выходные данные этого фильтра используется как входные данные другого фильтра.";"CICopyMachineTransition" = "Осуществляет переход от одного изображения к другому, симулируя эффект копировальной машины.";"CICrop" = "Выполняет усечение изображения. Размер и форма усеченного изображения соответствуют указанному Вами прямоугольнику.";"CICrystallize" = "Создает цветовые блоки в форме многоугольников путем объединения исходных значений цвета пикселей.";"CIDiscBlur" = "Сглаживает изображение или делает его более резким с помощью эффекта свертки округлой формы.";"CIDisintegrateWithMaskTransition" = "Осуществляет переход от одного изображения к другому с использованием фигуры, образованной маской.";"CIDisplacementDistortion" = "Применяет значения оттенков серого второго изображения к первому изображению. Получаемое изображение имеет текстуру, определяемую значениями оттенков серого.";"CIDissolveTransition" = "Использует растворение для осуществления перехода от одного изображения к другому.";"CIDotScreen" = "Симулирует рисунок точек экрана с полутональным изображением.";"CIEdges" = "Находит все края изображения и отображает их в цвете.";"CIEdgeWork" = "Создает стилизованные черно-белый вариант изображения, напоминающий гравюру на дереве.";"CIEightfoldReflectedTile" = "Создает мозаичное изображение из исходного изображения, применяя восьмикратно отраженную симметрию.";"CIExposureAdjust" = "Настраивает экспозицию изображения способом, сходным со способом управления экспозицией камеры при изменении диафрагмы.";"CIFalseColor" = "Преобразовывает яркость в цветовой градиент двух цветов. Для создания астрономических и других научных данных, как, например, ультрафиолетовые изображения или рентгеновские снимки, часто используется поддельный цвет.";"CIFastBoxBlur" = "Сглаживает изображение или делает его более резким с помощью эффекта свертки прямоугольной формы.";"CIFastDiscBlur" = "Сглаживает изображение или делает его более резким с помощью эффекта свертки округлой формы.";"CIFlashTransition" = "Осуществляет переход от одного изображения к другому, производя вспышку. Вспышка производится в указанный Вами момент. Первоначально она имеет незначительный размер, но быстро увеличивается до тех пор, пока все изображение не будет полностью заполнено цветом вспышки. По мере исчезновения цвета, начинает появляться получаемое изображение.";"CIFourfoldReflectedTile" = "Создает мозаичное изображение из исходного изображения, применяя четырехкратно отраженную симметрию.";"CIFourfoldRotatedTile" = "Создает мозаичное изображение из исходного изображения, вращая его с приращением на 90 градусов.";"CIFourfoldTranslatedTile" = "Создает мозаичное изображение из исходного изображения, применяя 4 действия перемещения.";"CIGammaAdjust" = "Настраивает яркость средних тонов. Данный фильтр, как правило, используется для компенсации нелинейных эффектов мониторов. Настройка гамма значительно изменяет наклон перехода между черным и белым.";"CIGaussianBlur" = "Располагает исходные пиксели в соответствии с количеством, которое установлено распределением Гаусса.";"CIGaussianGradient" = "Создает градиент от одного цвета к другому, используя распределение Гаусса.";"CIGlassDistortion" = "Искажает изображение, применяя стекловидную текстуру. Приподнятые участки получаемого изображения являются результатом применения карты текстуры.";"CIGlassLozenge" = "Создает ромбовидные линзы и искажает часть изображения, над которой размещена линза.";"CIGlideReflectedTile" = "Создает мозаичное изображение из исходного изображения, перемещая изображение и делая его размытым.";"CIGloom" = "Делает светлые участки изображения более тусклыми.";"CIHatchedScreen" = "Симулирует заштрихованный рисунок с полутональным изображением.";"CIHeightFieldFromMask" = "Создает постоянное трехмерное объемное поле из маски оттенков серого. Белые значения маски определяют пиксели внутри верхнего поля; черные значения определяют значения, находящиеся за его пределами. Изменения поля происходят плавно и постоянно внутри маски, достигая значения 0 на краю маски. Данный фильтр может быть использован с фильтром CIShadedMaterial для создания объектов с тенями высокой степени реалистичности.";"CIHexagonalPixellate" = "Отображает изображение в виде цветных многоугольников, цвет которых является средним значением пикселей, которые они замещают.";"CIHoleDistortion" = "Создает округлый участок, вытесняющий пиксели изображения по направлению от центра. Наибольшему искажению подвергаются ближайшие к окружности пиксели.";"CIHueAdjust" = "Изменяет общий оттенок исходных пикселей.";"CIKaleidoscope" = "Создает калейдоскопическое изображение из исходного изображения, применяя 12-кратную симметрию.";"CILanczosScaleTransform" = "Создает высококачественную версию исходного изображения с измененным размером. Как правило, данный фильтр используется для уменьшения изображения.";"CILenticularHaloGenerator" = "Симулирует гало, созданное преломлением, связанным с шириной линзы. Данный фильтр, как правило, применяется к другому изображению для симуляции светорассеяния в объективе и других сходных эффектов.";"CILineOverlay" = "Создает черный контур вокруг границ изображения, оставляя не очерченные контуром участки изображения прозрачными. Результат имеет alpha и отображен в черном цвете. Он будет невидим до тех пор, пока Вы не отобразите его поверх другого изображения с использованием компоновки наложения источника.";"CILineScreen" = "Симулирует рисунок экрана с линиями и с полутональным изображением.";"CILinearGradient" = "Создает градиент, изменяющийся по линейной оси между двумя определенными конечными точками.";"CIMaskToAlpha" = "Преобразует изображение оттенков серого в белое изображение, которое замаскировано alpha. Белые значения исходного изображения образуют внутреннюю часть маски, черные значения становятся полностью прозрачными.";"CIMaximumCompositing" = "Вычисляет максимальное значение двух исходных изображений, используя цветовой компонент, и создает изображение, используя максимальные значения. Данное действие сходно с увеличением контрастности.";"CIMedianFilter" = "Вычисляет среднее значение для группы соседних пикселей и заменяет каждое значение пикселя средним значением. Данный эффект служит для уменьшения шума.";"CIMinimumCompositing" = "Вычисляет минимальное значение двух исходных изображений, используя цветовой компонент, и создает изображение, используя минимальные значения. Данное действие сходно с выжиганием.";"CIModTransition" = "Осуществляет переход от одного изображения к другому через бесформенные отверстия.";"CIMotionBlur" = "Размывает изображение, симулируя эффект использования камеры, перемещаемой под определенным углом и на определенное расстояние во время захвата изображения.";"CIMultiplyCompositing" = "Увеличивает цветовой компонент двух исходных изображений и создает изображение, используя увеличенные значения. Данный фильтр, как правило, используется для добавления светового луча или сходного осветляющего эффекта.";"CINoiseReduction" = "Снижает шум, используя пороговое значение для определения того, что считается шумом. Небольшие изменения яркости, которые меньше данного значения, считаются шумом и к ним применяется действие по уменьшению шума, являющееся локальным размытием. Изменения, превышающие пороговое значение рассматриваются как границы и становятся более резкими.";"CIOpTile" = "Сегменты изображения, применяющие определенное изменение масштаба или вращение, а затем снова собирающие изображение для придания ему вид произведения опарт.";"CIPageCurlTransition" = "Осуществляет переход от одного изображения к другому, симулируя заворачивающуюся страницу. Новая страница появляется при заворачивании предыдущей страницы.";"CIParallelogramTile" = "Заворачивает изображение, отражая его в параллелограмме, а затем создает мозаичное изображение.";"CIPerspectiveTile" = "Выполняет перспективное преобразование изображения и располагает мозаикой преобразованное изображение.";"CIPerspectiveTransform" = "Изменяет геометрию изображения, чтобы симулировать изменение наблюдателем угла зрения. Вы можете использовать перспективный фильтр, чтобы наклонить изображение.";"CIPinchDistortion" = "Создает участок прямоугольной формы, который сжимает исходные пиксели по направлению внутрь. При этом в наибольшей степени искажаются ближайшие к прямоугольнику пиксели.";"CIPixellate" = "Делает изображение блочным.";"CIPointillize" = "Создает вариант изображения в стиле поинтилизма.";"CIRadialGradient" = "Создает градиент, изменяющийся радиально между двумя окружностями с совпадающими центрами. Он действителен для одной из двух окружностей с радиусом 0.";"CIRandomGenerator" = "Создает изображение неограниченного протяжения, чьи значения пикселей получены из четырех независимых, однородно распределенных случайных чисел от 0 до 1.";"CIRippleTransition" = "Осуществляет переход от одного изображения к другому, создавая круглую волну, исходящую из центральной точки. Новое изображение появляется в момент достижения волной ее высшей точки.";"CISepiaTone" = "Преобразовывает цвета изображения в различные оттенки коричневого цвета.";"CIShadedMaterial" = "Создает изображение с тенью от верхнего поля. Более высокие выступающие участки верхнего поля имеют более светлые тени, а более низкие участки – более темные тени. Вы можете комбинировать данный фильтр с фильтром CIHeightFieldFromMask для быстрого создания теней масок, как, например, текста.";"CISharpenLuminance" = "Усиливает деталь изображения путем повышения резкости. Отвечает за яркость изображения. Информация о цвете пикселей не претерпевает изменений.";"CISixfoldReflectedTile" = "Создает мозаичное изображение из исходного изображения, применяя шестикратно отраженную симметрию.";"CISixfoldRotatedTile" = "Создает мозаичное изображение из исходного изображения, вращая его с приращением на 60 градусов.";"CISourceAtopCompositing" = "Размещает исходное изображение поверх фонового изображения, а затем использует яркость фонового изображения, чтобы определить участок для показа. Комбинированное изображение совмещает фоновое изображение и те участки исходного изображения, которые находятся поверх видимых участков фона.";"CISourceInCompositing" = "Использует второе изображение, чтобы определить, какие участки исходного изображения будут оставлены. Выполняет эффективное усечение изображения.";"CISourceOutCompositing" = "Использует второе изображение, чтобы определить, какие участки первого изображения будут изъяты.";"CISourceOverCompositing" = "Размещает второе изображение поверх первого.";"CISpotColor" = "Заменяет один или более областей значений цвета комбинированными цветами.";"CISpotLight" = "Применяет эффект направленного луча света к изображению.";"CIStarShineGenerator" = "Создает рисунок вспышки звезды. Получаемое изображение, как правило, используется в качестве исходного изображения для другого фильтра.";"CIStripesGenerator" = "Создает рисунок полос. Вы можете настраивать цвет, контрастность полос, а также расстояние между ними.";"CISunbeamsGenerator" = "Создает эффект солнца. Как правило, выходные данные фильтра с эффектом солнечных лучей используются как входные данные композитного фильтра.";"CISwipeTransition" = "Осуществляет переход от одного изображения к другому, симулируя вихревое движение.";"CITorusLensDistortion" = "Создает тороидальные линзы и искажает часть изображения, над которой размещена линза.";"CITriangleTile" = "Составляет карту треугольного участка изображения на треугольной области, а затем создает мозаику из полученного изображения.";"CITwelvefoldReflectedTile" = "Создает мозаичное изображение из исходного изображения, применяя двенадцатикратно отраженную симметрию.";"CITwirlDistortion" = "Вращает пиксели вокруг одной точки для создания эффекта вихря. Вы можете указать количество вращений, а также центр и радиус эффекта.";"CIUnsharpMask" = "Увеличивает контрастность границ между пикселями различных цветов изображения.";"CIVortexDistortion" = "Вращает пиксели вокруг одной точки для создания эффекта воронки. Вы можете указать количество вращений, а также центр и радиус эффекта.";"CIWhitePointAdjust" = "Настраивает эталонную белую точку для изображения и составляет карту всех цветов источника, используя новый эталон.";"CIZoomBlur" = "Симулирует эффект наплыва камеры во время захвата изображения.";"CIColorBlendMode" = "Использует значения яркости фона со значениями оттенка и насыщенности исходного изображения. Данный режим сохраняет уровни серого в изображении.";"CIColorBurnBlendMode" = "Затемняет образцы фонового изображения для отражения образцов исходного изображения. Значения образца исходного изображения, которые определяют белый цвет, не вызывают изменение.";"CIColorDodgeBlendMode" = "Осветляет образцы фонового изображения для отражения образцов исходного изображения. Значения образца исходного изображения, которые определяют черный цвет, не вызывают изменение.";"CIDarkenBlendMode" = "Создает образцы композитного изображения, выбирая более темные образцы (из исходного изображения или фона). В результате образцы фонового изображения заменяются другими более темными образцами исходного изображения. В противном случае образцы фонового изображения изменены не будут.";"CIDifferenceBlendMode" = "Извлекает цвет образца исходного изображения из цвета образца изображения фона или наоборот, в зависимости от того, какой из образцов имеет более высокое значение яркости. Значения образца исходного изображения черного цвета не вызывают изменений; белые инвертируют цветовые значения фона.";"CIExclusionBlendMode" = "Создает эффект, сходный с эффектом, производимым фильтром CIDifferenceBlendMode, но с более низкой контрастностью. Значения образца исходного изображения черного цвета не вызывают изменений; белые инвертируют значения цвета фона.";"CIHardLightBlendMode" = "Умножает или сортирует цвета, в зависимости от цвета образца исходного изображения. Если цвет образца исходного изображения светлее, чем 50 % серого, то фон осветляется, как при сортировке. Если цвет образца исходного изображения темнее, чем 50 % серого, то фон темнеет, как при увеличении. Если цвет образца исходного изображения равен 50 % серого, исходное изображение не изменяется. Образцы изображения, равные чистому черному или чистому белому выдают чистый черный или чисто белый. Общий эффект сходен с эффектом, получаемым при наведении резкого луча света на исходное изображение.";"CIHueBlendMode" = "Использует значения яркости и насыщенности фона вместе с оттенком исходного изображения.";"CILightenBlendMode" = "Создает образцы композитного изображения, выбирая более светлые образцы (из исходного изображения или фона). В результате образцы фонового изображения заменяются другими более светлыми образцами исходного изображения. В противном случае образцы фонового изображения изменены не будут.";"CILuminosityBlendMode" = "Использует оттенок и насыщенность фона вместе с яркостью исходного изображения. Данный режим создает эффект, обратный эффекту, созданному с помощью фильтра CIColorBlendMode.";"CIMultiplyBlendMode" = "Увеличивает исходное изображение, используя образцы фонового изображения. В результате цвета темнеют, достигая, как минимум, уровень темноты одного из двух цветовых образцов.";"CIOverlayBlendMode" = "Увеличивает или сортирует образцы исходного изображения с образцами фонового изображения, в зависимости от цвета фона. Результатом является перекрытие существующего изображения, с сохранением светлых участков и тени фона. Цвет фона смешивается с исходным изображением для отражения яркости или темноты фона.";"CISaturationBlendMode" = "Использует значения яркости и оттенка фона вместе с насыщенностью исходного изображения. Участки фона, не имеющие насыщенности (т.е. участки чисто серого цвета) не вызывают изменений.";"CIScreenBlendMode" = "Увеличивает инверсию образцов исходного изображения, используя инвертированные образцы фонового изображения. В результате цвета светлеют, достигая, как минимум, уровень светлости одного из двух цветов образцов.";"CISoftLightBlendMode" = "Делает цвета более темными или светлыми, в зависимости от цвета образца исходного изображения. Если цвет образца исходного изображения светлее, чем 50 % серого, то фон осветляется, как при увеличении контрастности. Если цвет образца исходного изображения темнее, чем 50 % серого, то фон темнеет, как при выжигании. Если цвет образца исходного изображения равен 50 % серого, то фон не изменяется. Образцы изображения, равные чистому черному или чистому белому создают более темные или более светлые участки, но не чисто черные или белые участки. Общий эффект сходен с эффектом, получаемым при наведении рассеянного луча света на исходное изображение.";"outputImage" = "Изображение, созданное фильтром.";"inputBackgroundImage" = "Изображения для использования в качестве фона.";"inputImage" = "Изображение для использования в качестве источника. Для фильтров, использующих также фоновое изображение, данное изображение является накладываемым.";"inputTime" = "Длительность эффекта.";"inputTransform" = "Применяемая трансформация.";"inputScale" = "Величина эффекта.";"inputAspectRatio" = "Соотношение сторон.";"inputCenter" = "Центр участка в виде координат x и y, к которому будет применен фильтр.";"inputRadius" = "Расстояние от центра эффекта.";"inputAngle" = "Угол наклона.";"inputRefraction" = "Коэффициент преломления материала (например, стекла), используемый в эффекте.";"inputWidth" = "Ширина эффекта.";"inputSharpness" = "Величина применяемой резкости.";"inputIntensity" = "Интенсивность эффекта.";"inputEV" = "Количество раскрытий объектива для осветления или затемнения изображения.";"inputSaturation" = "Величина, используемая для настройки насыщенности.";"inputColor" = "Цвет.";"inputBrightness" = "Уровень яркости.";"inputContrast" = "Уровень контрастности.";"inputGradientImage" = "Карта выполнения с alpha. Как правило, данное изображение содержит светлые участки и тень.";"inputMaskImage" = "Маскирующее изображение.";"inputShadingImage" = "Карта выполнения со значениями alpha. Как правило, данное изображение содержит светлый участок и тень.";"inputTargetImage" = "Целевое изображения перехода.";"inputExtent" = "Прямоугольник, определяющий пределы эффекта.";"CIBoxBlur.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта размытия. Чем больше радиус, тем сильнее эффект размытия.";"CIDiscBlur.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта размытия. Чем больше радиус, тем сильнее эффект размытия.";"CIGaussianBlur.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта размытия. Чем больше радиус, тем сильнее эффект размытия.";"CIMotionBlur.inputRadius" ="Радиус указывает количество пикселей, использованных для создания эффекта размытия. Чем больше радиус, тем сильнее эффект размытия.";"CIMotionBlur.inputAngle" = "Угол направления движения определяет направление размытия.";"CINoiseReduction.inputNoiseLevel" = "Величина снижения шума. Чем выше значение, тем сильнее снижение шума.";"CINoiseReduction.inputSharpness" = "Резкость финального изображения. Чем больше значение, тем выше резкость.";"CIZoomBlur.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";"CIZoomBlur.inputAmount" = "Величина увеличения масштаба. Чем выше значения, тем сильнее увеличение.";"CIColorControls.inputSaturation" = "Уровень применяемой насыщенности. Чем выше значение, тем выше получаемая степень насыщенности.";"CIColorControls.inputBrightness" = "Уровень применяемой яркости. Чем выше значение, тем выше получаемая степень яркости.";"CIColorControls.inputContrast" = "Уровень применяемой контрастности. Чем выше значение, тем выше контрастность полученного изображения.";"CIColorMatrix.inputRVector" = "Количество красного, используемое для умножения значений исходного цвета.";"CIColorMatrix.inputGVector" = "Количество зеленого, используемое для умножения значений исходного цвета.";"CIColorMatrix.inputBVector" = "Количество синего, используемое для умножения значений исходного цвета.";"CIColorMatrix.inputAVector" = "Количество alpha, используемое для умножения значений исходного цвета.";"CIColorMatrix.inputBiasVector" = "Вектор, добавленный к каждому цветовому компоненту.";"CIExposureAdjust.inputEV" = "Величина настройки экспозиции. Чем выше значение, тем ярче экспозиция.";"CIGammaAdjust.inputPower" = "Значение гаммы для исправления яркости изображения. Чем выше значение, тем темнее получаемое изображение.";"CIHueAdjust.inputAngle" = "Угол (в градусах) для исправления оттенка изображения.";"CIWhitePointAdjust.inputColor" = "Цвет для использования в качестве белой точки.";"CIColorCube.inputDimension" = "Размер таблицы цветов.";"CIColorCube.inputCubeData" = "Это таблица цветов ячеек плавающей точки RGBA, использующих premultiplied alpha. Ячейки организованы в стандартном порядке. Колонки и ряды данных отмечены соответственно красным и зеленым цветами. Каждое поле данных сопровождается следующим, более высоким полем данных. При этом поля выделены синим цветом.";"CIColorMap.inputGradientImage" = "Данные этого изображения преобразовывают значения исходного изображения.";"CIColorMonochrome.inputColor" = "Монохромный цвет, применяемый к изображению.";"CIColorMonochrome.inputIntensity" = "Интенсивность монохромного эффекта. Значение 1.0 создает монохромное изображение с помощью поставляемого цвета. Значение 0.0 не оказывает влияние на изображение.";"CIColorPosterize.inputLevels" = "Количество уровней яркости для каждого цветового компонента. Более низкие значения приводят к более выраженному эффекту афиши.";"CIFalseColor.inputColor0" = "Первый цвет, использующийся для линейно изменяющегося цветового шаблона.";"CIFalseColor.inputColor1" = "Второй цвет, использующийся для линейно изменяющегося цветового шаблона.";"CISepiaTone.inputIntensity" = "Интенсивность эффекта сепия. Значение 1.0 создает монохромное изображение сепия. Значение 0.0 не оказывает влияние на изображение.";"CIBumpDistortion.inputCenter" = "Координаты x и y для использования в качестве центра рельефа."; "CIBumpDistortion.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения."; "CIBumpDistortion.inputScale" = "Уровень эффекта определяет степень изогнутости рельефа. Значение 0.0 указывает на отсутствие эффекта. Положительные значения создают выпуклый рельеф; отрицательные значения создают вогнутый рельеф."; "CIBumpDistortionLinear.inputCenter" = "Координаты x и y для использования в качестве центра искажения."; "CIBumpDistortionLinear.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения.";  "CIBumpDistortionLinear.inputScale" = "Степень эффекта."; "CIBumpDistortionLinear.inputAngle" = "Угол наклона линии (в градусах) вокруг которой проявляется эффект искажения."; "CICircleSplashDistortion.inputCenter" = "Координаты x и y для использования в качестве центра искажения.";  "CICircleSplashDistortion.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения.";  "CICircularWrap.inputCenter" = "Координаты x и y для использования в качестве центра искажения.";  "CICircularWrap.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения.";  "CICircularWrap.inputAngle" = "Угол наклона эффекта."; "CIDisplacementDistortion.inputDisplacementImage" = "Изображение, значения оттенков серого которого будут применены к исходному изображению."; "CIDisplacementDistortion.inputScale" = "Величина текстуризации получаемого изображения. Чем выше значение, тем выше величина текстуризации."; "CIGlassDistortion.inputTexture" = "Текстура, применяемая к исходному изображению.";"CIGlassDistortion.inputCenter" = "Координаты x и y для использования в качестве центра искажения."; "CIGlassDistortion.inputScale" = "Величина текстуризации получаемого изображения. Чем выше значение, тем выше величина текстуризации."; "CIGlassLozenge.inputPoint0" = "Координаты x и y, определяющие центр окружности на одном конце ромба."; "CIGlassLozenge.inputPoint1" = "Координаты x и y, определяющие центр окружности на другом конце ромба.";  "CIGlassLozenge.inputRadius" = "Радиус ромба. Чем больше радиус, чем выше уровень искажения.";  "CIGlassLozenge.inputRefraction" = "Преломление стекла."; "CIHoleDistortion.inputCenter" = "Координаты x и y для использования в качестве центра искажения.";  "CIHoleDistortion.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения.";  "CIPinchDistortion.inputCenter" = "Координаты x и y для использования в качестве центра искажения."; "CIPinchDistortion.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения."; "CIPinchDistortion.inputScale" = "Величина сжатия. Значение 0.0 указывает на отсутствие эффекта. Значение 1.0 – максимальное сжатие.";"CITorusLensDistortion.inputCenter" = "Координаты x и y для использования в качестве центра тора.";  "CITorusLensDistortion.inputRadius" = "Внешний радиус тора.";  "CITorusLensDistortion.inputWidth" = "Ширина кольца."; "CITorusLensDistortion.inputRefraction" = "Преломление стекла."; "CITwirlDistortion.inputCenter" = "Координаты x и y для использования в качестве центра искажения.";  "CITwirlDistortion.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения."; "CITwirlDistortion.inputAngle" = "Угол наклона вихреобразного искажения (в градусах). Значения могут быть позитивными или негативными.";"CIVortexDistortion.inputCenter" = "Координаты x и y для использования в качестве центра искажения."; "CIVortexDistortion.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта искажения. Чем больше радиус, тем сильнее эффект искажения."; "CIVortexDistortion.inputAngle" = "Угол наклона воронки (в градусах).";"CICheckerboardGenerator.inputColor0" = "Цвет для первого набора полей шахматной доски.";"CICheckerboardGenerator.inputColor1" = "Цвет для второго набора полей шахматной доски.";"CICheckerboardGenerator.inputWidth" = "Ширина поля рисунка шахматной доски.";"CICheckerboardGenerator.inputSharpness" = "Резкость рисунка шахматной доски. Чем меньше значение, тем больше эффект размытости рисунка. Значение варьируется от 0.0 до 1.0.";"CIConstantColorGenerator.inputColor" = "Создаваемый цвет."; "CILenticularHaloGenerator.inputCenter" = "Координаты x и y для использования в качестве центра гало.";"CILenticularHaloGenerator.inputHaloRadius" = "Радиус гало.";"CILenticularHaloGenerator.inputHaloWidth" = "Ширина гало, от внутреннего до внешнего радиуса.";"CILenticularHaloGenerator.inputOverlap" = "Величина перекрытия компонентов преломления гало. Значение 1.0 соответствует полному перекрытию; при этом гало имеет белый цвет. Значение 0.0 – отсутствие перекрытия; цвета гало не перекрываются.";"CILenticularHaloGenerator.inputStriationStrength" = "Интенсивность цветов гало. Чем выше значения, тем выше их интенсивность.";"CILenticularHaloGenerator.inputStriationContrast" = "Контраст цветов гало. Чем выше значения, тем выше контраст.";"CIStarShineGenerator.inputCenter" = "Координаты x и y для использования в качестве центра звезды."; "CIStarShineGenerator.inputColor" = "Цвет для внешней оболочки циркулярной звезды."; "CIStarShineGenerator.inputRadius" = "Радиус звезды."; "CIStarShineGenerator.inputCrossScale" = "Размер перекрестного рисунка."; "CIStarShineGenerator.inputCrossAngle" = "Угол наклона перекрестного рисунка."; "CIStarShineGenerator.inputCrossOpacity" = "Непрозрачность перекрестного рисунка."; "CIStarShineGenerator.inputCrossWidth" = "Ширина перекрестного рисунка."; "CIStarShineGenerator.inputEpsilon" = "Длина пересекающихся клиньев."; "CIStripesGenerator.inputCenter" = "Координаты x и y для использования в качестве центра рисунка полос."; "CIStripesGenerator.inputColor0" = "Цвет для четных полос."; "CIStripesGenerator.inputColor1" = "Цвет для четных полос.";"CIStripesGenerator.inputWidth" = "Ширина полосы."; "CIStripesGenerator.inputSharpness" = "Резкость рисунка полос. Чем меньше значение, тем больше эффект размытости рисунка. Значение варьируется от 0.0 до 1.0."; "CISunbeamsGenerator.inputCenter" = "Координаты x и y для использования в качестве центра рисунка солнечного луча.";"CISunbeamsGenerator.inputColor" = "Цвет солнца.";"CISunbeamsGenerator.inputSunRadius" = "Радиус солнца.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Радиус солнечных лучей.";"CISunbeamsGenerator.inputStriationStrength" = "Интенсивность солнечных лучей. Чем выше значения, тем выше интенсивность.";"CISunbeamsGenerator.inputStriationContrast" = "Контрастность солнечных лучей. Чем выше значения, тем выше контрастность.";"CIAffineTransform.inputTransform" = "Преобразование, применяемое к изображению."; "CICrop.inputRectangle" = "Прямоугольник, ограничивающий участок для усечения изображения."; "CILanczosScaleTransform.inputScale" = "Коэффициент масштаба, применяемый к изображению. Значения до 1.0 уменьшают изображение. Значения, превышающие 1.0 увеличивают изображение."; "CILanczosScaleTransform.inputAspectRatio" = "Соотношение сторон изображения."; "CIPerspectiveTransform.inputTopLeft" = "Верхняя левая координата для привязки изображения."; "CIPerspectiveTransform.inputTopRight" = "Верхняя правая координата для привязки изображения."; "CIPerspectiveTransform.inputBottomRight" = "Нижняя правая координата для привязки изображения."; "CIPerspectiveTransform.inputBottomLeft" = "Нижняя левая координата для привязки изображения."; "CIGaussianGradient.inputColor0" = "Первый цвет для использования в градиенте."; "CIGaussianGradient.inputColor1" = "Второй цвет для использования в градиенте."; "CIGaussianGradient.inputRadius" = "Радиус распределения Гаусса."; "CILinearGradient.inputPoint0" = "Начальная позиция градиента – начальная позиция первого цвета."; "CILinearGradient.inputPoint1" = "Конечная позиция градиента – начальная позиция второго цвета."; "CILinearGradient.inputColor0" = "Первый цвет для использования в градиенте.";  "CILinearGradient.inputColor1" = "Второй цвет для использования в градиенте.";  "CIRadialGradient.inputRadius0" = "Радиус начальной окружности для использования в градиенте.";"CIRadialGradient.inputRadius1" = "Радиус конечной окружности для использования в градиенте.";"CIRadialGradient.inputColor0" = "Первый цвет для использования в градиенте.";  "CIRadialGradient.inputColor1" = "Второй цвет для использования в градиенте."; "CICircularScreen.inputCenter" = "Координаты x и y для использования в качестве центра рисунка кругового изображения."; "CICircularScreen.inputWidth" = "Расстояние между окружностями рисунка."; "CICircularScreen.inputSharpness" = "Резкость окружностей. Чем больше значение, тем выше резкость окружностей."; "CICMYKHalftone.inputCenter" = "Координаты x и y для использования в качестве центра полутонального рисунка.";  "CICMYKHalftone.inputWidth" = "Расстояние между точками рисунка."; "CICMYKHalftone.inputAngle" = "Угол наклона рисунка."; "CICMYKHalftone.inputSharpness" = "Резкость рисунка. Чем больше значение, тем выше резкость рисунка."; "CICMYKHalftone.inputGCR" = "Заменяющее значение серого компонента. Значение может варьироваться от 0.0 (отсутствие) до 1.0."; "CICMYKHalftone.inputUCR" = "Значение вычитания цветной краски (RCR). Значение может варьироваться от 0.0 до 1.0."; "CIDotScreen.inputCenter" = "Координаты x и y для использования в качестве центра рисунка точечного изображения.";  "CIDotScreen.inputAngle" = "Угол наклона рисунка."; "CIDotScreen.inputWidth" = "Расстояние между точками рисунка."; "CIDotScreen.inputSharpness" = "Резкость рисунка. Чем больше значение, тем выше резкость рисунка."; "CIHatchedScreen.inputCenter" = "Координаты x и y для использования в качестве центра заштрихованного рисунка."; "CIHatchedScreen.inputAngle" = "Угол наклона рисунка.";"CIHatchedScreen.inputWidth" = "Расстояние между линиями рисунка."; "CIHatchedScreen.inputShaprness" = "Резкость рисунка. Чем больше значение, тем выше резкость рисунка."; "CILineScreen.inputCenter" = "Координаты x и y для использования в качестве центра рисунка экрана с линиями.";  "CILineScreen.inputAngle" = "Угол наклона рисунка."; "CILineScreen.inputWidth" = "Расстояние между линиями рисунка."; "CILineScreen.inputSharpness" = "Резкость рисунка. Чем больше значение, тем выше резкость рисунка."; 	"CISharpenLuminance.inputSharpness" = "Величина применяемой резкости. Чем выше значения, тем выше резкость.";"CIUnsharpMask.inputRadius" = "Радиус окружности вокруг определенного пикселя для применения маски для снижения резкости. Чем больше радиус, тем больше участок изображения, к которому применяется эффект.";"CIUnsharpMask.inputIntensity" = "Интенсивность эффекта. Чем выше значение, тем выше контрастность затронутого участка.";"CIBlendWithMask.inputMaskImage" = "Маска оттенков серого. Если значение маски равно 0.0, результатом является фон. При значении маски равным 1.0 результатом является изображение."; "CIBloom.inputRadius" = "Радиус определяет количество пикселей, использованных для создания эффекта. Чем больше радиус, тем сильнее эффект.";"CIBloom.inputIntensity" = "Интенсивность эффекта. Значение 0.0 указывает на отсутствие эффекта. Значение 1.0 – максимальный эффект."; "CICrystallize.inputRadius" = "Радиус указывает количество пикселей, использованных для создания эффекта. Чем больше радиус, тем крупнее получаемые в результате кристаллы."; "CIEdges.inputIntensity" = "Яркость краев. Чем выше значение, тем ярче края."; "CIEdgeWork.inputRadius" = "Толщина краев. Чем выше значение, тем толще края."; "CIGloom.inputRadius" = "Радиус определяет количество пикселей, использованных для создания эффекта. Чем больше радиус, тем сильнее эффект."; "CIGloom.inputIntensity" = "Интенсивность эффекта. Значение 0.0 указывает на отсутствие эффекта. Значение 1.0 – максимальный эффект."; "CIHeightFieldFromMask.inputImage" = "Белые значения маски определяют пиксели, находящиеся внутри верхнего поля; черные значения определяют пиксели, находящиеся за его пределами. Изменение поля происходит плавно и непрерывно внутри маски, достигая значения 0 на краю маски."; "CIHeightFieldFromMask.inputRadius" = "Расстояние от края маски, необходимое для гладкого перехода, должно быть пропорционально исходному радиусу. Более высокие значения делают переход более сглаженным и отчетливым. Результатом более низких значений является приблизительное равенство перехода радиусу окружности."; "CIHexagonalPixellate.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CIHexagonalPixellate.inputScale" = "Масштаб определяет размер многоугольников. Более высокие значения приводят к получению более крупных по размеру многоугольников."; "CILineOverlay.inputNRNoiseLevel" = "Уровень шума изображения (используется с данными камеры), который устраняется перед пересечением границ изображения. Увеличение уровня шума поможет очистить пересеченные границы изображения."; "CILineOverlay.inputNRSharpness" = "Величина резкости при удалении шума изображения перед пересечением границ изображения. Улучшает получение границ."; "CILineOverlay.inputEdgeIntensity" = "Величина выделения информации градиента, полученного методом Собеля, при пересечении границ изображения. Более высокие значения обнаруживают большее количество границ, однако, как правило, используется более низкое значение (например 1.0)."; "CILineOverlay.inputThreshold" = "Значение определяет видимость границ. Более высокие значения приводят к утоньшению границ."; "CILineOverlay.inputContrast" = "Величина сглаживания границ, полученная при использовании данного фильтра. Чем выше значения, тем ярче выражены границы (они менее сглажены)."; "CIPixellate.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIPixellate.inputScale" = "Масштаб определяет размер квадратов. Более высокие значения приводят к получению более крупных по размеру квадратов."; "CIPointillize.inputRadius" = "Радиус окружностей получаемого рисунка."; "CIPointillize.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIShadedMaterial.inputShadingImage" = "Изображение для использования в качестве верхнего поля. Получаемое изображение имеет более высокие выступающие участки с более светлыми тенями и более низкие выступающие участки с более темными тенями."; "CIShadedMaterial.inputScale" = "Степень эффекта. Чем выше значение, тем ярче эффект."; "CISpotColor.inputCenterColor1" = "Центральное значение области значений первого цвета, которое необходимо заменить."; "CISpotColor.inputReplacementColor1" = "Заменяющий цвет для области значений первого цвета."; "CISpotColor.inputCloseness1" = "Значение, указывающее, насколько должен соответствовать первый цвет, перед тем, как он будет заменен."; "CISpotColor.inputContrast1" = "Контрастность первого заменяющего цвета."; "CISpotColor.inputCenterColor2" = "Центральное значение области значений второго цвета, которое необходимо заменить."; "CISpotColor.inputReplacementColor2" = "Заменяющий цвет для области значений второго цвета.";"CISpotColor.inputCloseness2" = "Значение, указывающее, насколько должен соответствовать второй цвет, перед тем, как он будет заменен."; "CISpotColor.inputContrast2" = "Контрастность второго заменяющего цвета."; "CISpotColor.inputCenterColor3" = "Центральное значение области значений третьего цвета, которое необходимо заменить.";  "CISpotColor.inputReplacementColor3" = "Заменяющий цвет для области значений третьего цвета."; "CISpotColor.inputCloseness3" = "Значение, указывающее, насколько должен соответствовать третий цвет, перед тем, как он будет заменен.";  "CISpotColor.inputContrast3" = "Контрастность третьего заменяющего цвета.";  "CISpotLight.inputLightPosition" = "Координаты x и y луча света."; 		"CISpotLight.inputLightPointsAt" = "Координаты x и y, на которые направлен луч света.";  "CISpotLight.inputBrightness" = "Яркость луча света."; "CISpotLight.inputConcentration" = "Размер луча света. Чем ниже значение, тем сильнее сфокусирован луч."; "CISpotLight.inputColor" = "Цвет луча света."; "CIAffineClamp.inputTransform" = "Преобразование, применяемое к изображению."; "CIAffineTile.inputTransform" = "Преобразование, применяемое к изображению."; "CIEightfoldReflectedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIEightfoldReflectedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах)."; "CIEightfoldReflectedTile.inputWidth" = "Ширина элемента мозаики."; "CIFourfoldReflectedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIFourfoldReflectedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CIFourfoldReflectedTile.inputAcuteAngle" = "Исходный угол наклона повторяющегося отраженного элемента мозаики. Низкие значения создают тонкие ромбовидные элементы мозаики; высокие значения создают массивные отраженные элементы."; "CIFourfoldReflectedTile.inputWidth" = "Ширина элемента мозаики.";  "CIFourfoldRotatedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIFourfoldRotatedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CIFourfoldRotatedTile.inputWidth" = "Ширина элемента мозаики."; "CIFourfoldTranslatedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIFourfoldTranslatedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "Исходный угол наклона повторяющегося перемещенного элемента мозаики. Низкие значения создают тонкие ромбовидные элементы мозаики; высокие значения создают массивные перемещенные элементы."; "CIFourfoldTranslatedTile.inputWidth" = "Ширина элемента мозаики.";  "CIGlideReflectedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIGlideReflectedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CIGlideReflectedTile.inputWidth" = "Ширина элемента мозаики.";  "CIKaleidoscope.inputCount" = "Количество отражений рисунка."; "CIKaleidoscope.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIKaleidoscope.inputAngle" = "Угол отражения."; "CIOpTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CIOpTile.inputScale" = "Масштаб определяет количество элементов мозаики эффекта."; "CIOpTile.inputAngle" = "Угол наклона элемента мозаики."; "CIOpTile.inputWidth" = "Ширина элемента мозаики."; "CIParallelogramTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CIParallelogramTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CIParallelogramTile.inputAcuteAngle" = "Исходный угол наклона повторяющегося элемента мозаики, имеющего форму параллелограмм. Низкие значения создают тонкие ромбовидные элементы мозаики; высокие значения создают массивные элементы, имеющие форму параллелограмм."; "CIParallelogramTile.inputWidth" = "Ширина элемента мозаики.";  "CIPerspectiveTile.inputTopLeft" = "Верхняя левая координата элемента мозаики."; "CIPerspectiveTile.inputTopRight" = "Верхняя правая координата элемента мозаики.";"CIPerspectiveTile.inputBottomRight" = "Нижняя правая координата элемента мозаики."; "CIPerspectiveTile.inputBottomLeft" = "Нижняя левая координата элемента мозаики."; "CISixfoldReflectedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CISixfoldReflectedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CISixfoldReflectedTile.inputWidth" = "Ширина элемента мозаики."; "CISixfoldRotatedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CISixfoldRotatedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CISixfoldRotatedTile.inputWidth" = "Ширина элемента мозаики.";  "CITriangleTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта.";  "CITriangleTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";  "CITriangleTile.inputWidth" = "Ширина элемента мозаики.";  "CITwelvefoldReflectedTile.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CITwelvefoldReflectedTile.inputAngle" = "Угол наклона мозаичного рисунка (в градусах).";"CITwelvefoldReflectedTile.inputWidth" = "Ширина элемента мозаики."; "CIBarsSwipeTransition.inputAngle" = "Угол наклона полос (в градусах).";	"CIBarsSwipeTransition.inputWidth" = "Ширина каждой полосы.";	"CIBarsSwipeTransition.inputBarOffset" = "Расстояние одной полосы от другой";	"CIBarsSwipeTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CICopyMachineTransition.inputColor" = "Цвет света копировальной машины.";"CICopyMachineTransition.inputAngle" = "Угол наклона света копировальной машины.";"CICopyMachineTransition.inputWidth" = "Ширина света копировальной машины.";"CICopyMachineTransition.inputOpacity" = "Непрозрачность света копировальной машины. Значение 0.0 – прозрачность. Значение 1.0 – непрозрачность.";"CICopyMachineTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Изображение, определяющее фигуру для использования при разложении из источника к целевому изображению.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Радиус тени, созданной маской.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "Плотность тени, созданной маской.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Отступ тени, созданной маской.";"CIDisintegrateWithMaskTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIDissolveTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIFlashTransition.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CIFlashTransition.inputExtent" = "Диапазон действия вспышки.";"CIFlashTransition.inputColor" = "Цвет световых лучей вспышки.";"CIFlashTransition.inputMaxStriationRadius" = "Радиус световых лучей вспышки.";"CIFlashTransition.inputStriationStrength" = "Интенсивность световых лучей вспышки.";"CIFlashTransition.inputStriationContrast" = "Контрастность световых лучей вспышки.";"CIFlashTransition.inputFadeThreshold" = "Длительность затухания между вспышкой и получаемым изображением. Чем выше значение, тем выше длительность вспышки и ниже длительность затухания.";"CIFlashTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIModTransition.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CIModTransition.inputAngle" = "Угол наклона прорезного рисунка.";"CIModTransition.inputRadius" = "Радиус неискаженных отверстий рисунка.";"CIModTransition.inputCompression" = "Величина растяжения, примененная к прорезному рисунку. Отверстия в центре не искажены в такой степени, как отверстия по краям изображения.";"CIModTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIPageCurlTransition.inputBacksideImage" = "Изображение, появляющееся за исходным изображением, при заворачивании страницы и появлении целевого изображения.";"CIPageCurlTransition.inputShadingImage" = "Изображение, выглядящее как затененная сфера, заключенная в квадратное изображение.";"CIPageCurlTransition.inputExtent" = "Пределы эффекта.";"CIPageCurlTransition.inputAngle" = "Угол наклона завернутой страницы.";"CIPageCurlTransition.inputRadius" = "Радиус заворачивания.";"CIPageCurlTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIRippleTransition.inputShadingImage" = "Изображение, выглядящее как затененная сфера, заключенная в квадратное изображение.";"CIRippleTransition.inputCenter" = "Координаты x и y для использования в качестве центра эффекта."; "CIRippleTransition.inputExent" = "Пределы эффекта.";"CIRippleTransition.inputWidth" = "Ширина ряби.";"CIRippleTransition.inputScale" = "Значение, определяющее, начинается ли эффект ряби с выпуклости (высокое значение) или впадины (низкое значение).";"CIRippleTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CISwipeTransition.inputExtent" = "Пределы эффекта.";"CISwipeTransition.inputColor" = "Цвет эффекта вихревого движения.";"CISwipeTransition.inputAngle" = "Угол наклона вихревого движения.";"CISwipeTransition.inputWidth" = "Ширина вихревого движения.";"CISwipeTransition.inputOpacity" = "Непрозрачность вихревого движения.";"CISwipeTransition.inputTime" = "Параметрическое время перехода. Данное значение передвигает эффект перехода от начала (час 0) к концу (час 1).";"CIAreaHistogram" = "Создает гистограмму для определенной области изображения, преобразовывая результат в одномерное изображение.";"CIAreaHistogram.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIAreaHistogram.inputCount" = "Количество столбиков гистограммы.";"CIAreaHistogram.inputImage" = "Изображение, для которого Вы хотите построить гистограмму.";"CIAreaHistogram.inputScale" = "Значение масштабного коэффициента, используемого для значений гистограммы.";"CIAreaMaximum" = "Вычисляет максимальные значения компонентов определенной области изображения, преобразовывая результат в пиксели.";"CIAreaMaximum.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIAreaMaximum.inputImage" = "Обрабатываемое изображение.";"CIAreaMinimum" = "Вычисляет минимальные значения компонентов определенной области изображения, преобразовывая результат в пиксели.";"CIAreaMinimum.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIAreaMinimum.inputImage" = "Обрабатываемое изображение.";"CIAreaMaximumAlpha" = "Находит и отражает пиксель с максимальным значением alpha.";"CIAreaMaximumAlpha.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIAreaMaximumAlpha.inputImage" = "Обрабатываемое изображение.";"CIAreaMinimumAlpha" = "Находит и отражает пиксель с минимальным значением alpha.";"CIAreaMinimumAlpha.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIAreaMinimumAlpha.inputImage" = "Обрабатываемое изображение.";"CIAreaAverage" = "Вычисляет приблизительный цвет определенной области изображения, преобразовывая результат в пиксели.";"CIAreaAverage.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIAreaAverage.inputImage" = "Обрабатываемое изображение.";"CIRowAverage" = "Вычисляет приблизительный цвет каждого ряда определенной области изображения, преобразовывая результат в одномерное изображение.";"CIRowAverage.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIRowAverage.inputImage" = "Обрабатываемое изображение.";"CIColumnAverage" = "Вычисляет приблизительный цвет определенной области изображения, преобразовывая результат в одномерное изображение.";"CIColumnAverage.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIColumnAverage.inputImage" = "Обрабатываемое изображение.";"CIMinimumComponent" = "Преобразует изображение в оттенки серого, используя как минимум компоненты трех цветов.";"CIMinimumComponent.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIMinimumComponent.inputImage" = "Обрабатываемое изображение.";"CIMaximumComponent" = "Преобразует изображение в оттенки серого, используя максимум компоненты трех цветов.";"CIMaximumComponent.inputExtent" = "Прямоугольник, указывающий область изображения, которую Вы хотите обработать.";"CIMaximumComponent.inputImage" = "Обрабатываемое изображение.";